main(){

  //Exercise
  // 1부터 10까지의 수중 짝수의 합과 홀수의 합을 각각 구하기(단, for문은 1개)
  // 1부터 10까지의 수중 짝수의 합은 ___이고 홀수의 합은 ___입니다.

  // Exercise
  // 1부터 100까지 수중 2의 배수의 합계, 5의 배수의 합계, 10의 배수의 합계 구하기
  // (단, for문은 1개)

  // Exercise
  // 1부터 100까지 수중 2의 배수의 합계, 5의 배수의 합계, 10의 배수의 합계 구하기
  // (단, for문은 1개, if, switch 금지) 

  // Exercise: 구구단 2~9단 중 짝수단과 짝수 곱해지는 수만 출력하기
  // 단, if 문 사용 금지

  // Exercise: 구구단 2~9단 중 짝수단과 짝수 곱해지는 수의 결과를 List로 저장하여
  // 해당 List의 합계와 평균 구하기
  // 단, if 문 사용 금지 

  // Factorial 구하기
  // 4! = 4*3*2*1

  // 결과
  /*
    4's factorial value = 24
  */ 

  // List를 이용해서 5보다 작은 숫자만 새로운 List에 생성하기
  // 입력숫자 : 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89

  // 결과
  /*
    [1, 1, 2, 3]
  */

  // List의 최댓값과 최댓값의 위치 구하기 *
  // 입력 숫자 11, 12, 13, 14, 15

  // 결과
  /*
    숫자들 중 최댓값은 15이고 5번째 값 입니다.
  */

  // 입력한 숫자의 한자릿 수 정수의 합 구하기 *
  // 입력 숫자: 12345678

  // 결과
  /*
    Sum of 12345678 = 36
  */

}
